In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [7]:
pstore = pd.read_csv("newdataset.csv")
pstore.head(10)

  name  score  attempt
0    a    200        2
1    b    300        3
2    c     40        2

In [44]:
len(newdataset)

3

In [20]:
newdataset.attempt.sum()

7

In [18]:
newdataset.loc[newdataset.attempt>2]

  name  score  attempt
1    b    300        3

In [22]:
newdataset.count()

name       3
score      3
attempt    3
dtype: int64

In [23]:
newdataset.describe()

           score   attempt
count    3.00000  3.000000
mean   180.00000  2.333333
std    131.14877  0.577350
min     40.00000  2.000000
25%    120.00000  2.000000
50%    200.00000  2.000000
75%    250.00000  2.500000
max    300.00000  3.000000

In [38]:
newdataset.loc[newdataset.score>200]

  name  score  attempt
1    b    300        3

In [39]:
#replacing a vlaue in data
newdataset.at[1,'score']='700'

In [42]:
newdataset.score

0    200
1    700
2     40
Name: score, dtype: int64

In [43]:
#finding mean/average
newdataset.score.sum()/3

313.3333333333333

In [47]:
newdataset.score.mean()

313.3333333333333

In [48]:
newdataset.score.max(),newdataset.score.min()

(700, 40)